/**
 * Created by wzq on 2017/8/29.
 */
/**
 * ES6的一些总结
 *  var 命令会发生“变量提升”现象，即变量可以在声明之前使用，值为undefined
 *  在代码块内，使用let命令声明变量之前，该变量都是不可用的。这在语法上，称为“暂时性死区”
 *  let不允许在相同作用域内，重复声明一个变量（因此，不能在函数内部重新声明参数）
 *  const声明一个只读的常量。一旦声明，常量的值就不能改变。
 */
//1:let声明的变量只在它所在的代码块有效
//for循环的计数器，就很适合使用let命令。
// var a=[];
// for(var i=0;i<10;i++){
//     a[i]=function(){
//         console.log(i);
//     };
// }
// a[6]();//10
//
// var a=[];
// for(let i=0;i<10;i++){
//     a[i]=function(){
//         console.log(i);
//     };
// }
// a[6]();//6

//正则表达式 去掉url里面的转义字符
// s = s.replace(/[\'\"\b\f\n\r\t]/g, '');

