import { checkInt } from "../../Utils/GameUtils"

let guideDesc:any = {
    101:"引导1步-棋盘说明",
    102:"引导2步-首次出现2颗棋子",
	103:"引导3步-拖动投弹手至棋盘",
	104:"引导4步-放子说明",
	105:"引导5步-刷新棋子说明",
	106:"引导6步-拖动弓箭手至棋盘",
	107:"引导7步-拖动牧师至棋盘",
	108:"引导8步-回合胜利说明",
	109:"引导9步-扣血说明",
	110:"引导10步-棋子合成",
	111:"引导11步-拖动投弹手合成",
	112:"引导12步-拖动投弹手合成至3级",
	113:"引导13步-拖动投弹手合成至4级",
	114:"引导14步-点击查看刀棋子攻击范围",
	115:"引导15步-刀棋子攻击范围说明",
	116:"引导16步-点击查看弓箭棋子攻击范围",
	117:"引导17步-说明射程优势",
	118:"引导18步-放开自由放子",
	201:"引导19步-点击天梯入口",
	202:"引导20步-领取0段位奖励",
	301:"引导21步-关闭领奖tip",
	302:"引导22步-点返回按钮退出天梯界面",
	401:"引导23步-点击棋盒",
	402:"引导24步-点击新获得的风之图腾",
	403:"引导25步-选择使用风之图腾",
	404:"引导26步-与冰法交换",
	405:"引导27步-点击对战按钮",
	406:"引导28步-引导结束",
}

/**
 * 引导步骤描述
 */
export function getGuideStepDesc(stepId:string,stepSubId:string){
    return guideDesc[checkInt(stepSubId)] || "step"+stepSubId
}

